conn/vsds/VSDService.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<!-- gematik revision="\main\rel_online\rel_ors1\1" -->
<!-- edited with XMLSpy v2010 (http://www.altova.com) by n.n. (gematik) -->
<definitions xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:GERROR="http://ws.gematik.de/tel/error/v2.0" xmlns:VSD="http://ws.gematik.de/conn/vsds/VSDService/v5.2" name="VSD" targetNamespace="http://ws.gematik.de/conn/vsds/VSDService/v5.2">
	<documentation>
		Copyright (c) 2011, gematik - Gesellschaft für Telematikanwendungen der Gesundheitskarte mbH. Alle Rechte vorbehalten.
		Beschreibung: Dienste zum Lesen der Versichertenstammten von einer eGK
	</documentation>
	<types>
		<xs:schema>
			<xs:import schemaLocation="VSDService.xsd" namespace="http://ws.gematik.de/conn/vsds/VSDService/v5.2"/>
			<xs:import schemaLocation="../../tel/error/TelematikError.xsd" namespace="http://ws.gematik.de/tel/error/v2.0"/>
		</xs:schema>
	</types>
	<message name="ReadVSDRequestMessage">
		<part name="parameter" element="VSD:ReadVSD"/>
	</message>
	<message name="ReadVSDResponseMessage">
		<part name="parameter" element="VSD:ReadVSDResponse"/>
	</message>
	<message name="FaultMessage">
		<part name="parameter" element="GERROR:Error"/>
	</message>
	<portType name="VSDServicePortType">
		<operation name="ReadVSD">
			<input message="VSD:ReadVSDRequestMessage"/>
			<output message="VSD:ReadVSDResponseMessage"/>
			<fault name="FaultMessage" message="VSD:FaultMessage"/>
		</operation>
	</portType>
	<binding name="VSDServiceBinding" type="VSD:VSDServicePortType">
		<soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
		<operation name="ReadVSD">
			<soap:operation soapAction="http://ws.gematik.de/conn/vsds/VSDService/v6.0#ReadVSD"/>
			<input>
				<soap:body use="literal"/>
			</input>
			<output>
				<soap:body use="literal"/>
			</output>
			<fault name="FaultMessage">
				<soap:fault name="FaultMessage" use="literal"/>
			</fault>
		</operation>
	</binding>
	<service name="VSDService">
		<port name="VSDServicePort" binding="VSD:VSDServiceBinding">
			<soap:address location="http://unspecified"/>
		</port>
	</service>
</definitions>
